module {
  func.func @pad_matmul(%arg0: tensor<30x30xf32>, %arg1: tensor<30x30xf32>, %arg2: tensor<30x30xf32>) -> tensor<30x30xf32> {
    %0 = linalg.matmul ins(%arg0, %arg1 : tensor<30x30xf32>, tensor<30x30xf32>) outs(%arg2 : tensor<30x30xf32>) -> tensor<30x30xf32>
    return %0 : tensor<30x30xf32>
  }
}

